Eidon-AI/eidon-tracker/firmware/sdkconfig.defaults
# Target chip configuration
CONFIG_IDF_TARGET="esp32c6"

# Bluetooth configuration
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_HID_ENABLED=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
# Classic Bluetooth disabled - using only BLE
# CONFIG_BT_CLASSIC_ENABLED is not set
# CONFIG_BT_HID_DEVICE_ENABLED is not set
# CONFIG_BT_SDP_COMMON_ENABLED is not set
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# BNO08x GPIO Configuration for Seeed XIAO ESP32-C6
CONFIG_ESP32_BNO08X_GPIO_HINT=22
CONFIG_ESP32_BNO08X_GPIO_RST=23
CONFIG_ESP32_BNO08X_GPIO_CS=17
CONFIG_ESP32_BNO08X_GPIO_SCL=19
CONFIG_ESP32_BNO08X_GPIO_DI=18
CONFIG_ESP32_BNO08X_GPIO_SDA=20
CONFIG_ESP32_BNO08X_GPIO_WAKE=2

# SPI Configuration
CONFIG_ESP32_BNO08x_SPI_HOST=2
CONFIG_ESP32_BNO08X_SCL_SPEED_HZ=3000000
CONFIG_ESP32_BNO08X_SPI_INTR_CPU_AFFINITY=0

# Task configuration
CONFIG_ESP32_BNO08X_DATA_PROC_TASK_SZ=4096

# Debug
# CONFIG_ESP32_BNO08x_DEBUG_STATEMENTS is not set
